{
  "pr_number": 1777,
  "changes": [
    {
      "change": "Chores",
      "description": "The tests' build process now utilises the Angular compiler in order to compile the app AOT, instead of using the TypeScript compiler to compile the app JIT."
    },
    {
      "change": "Chores",
      "description": "V8 was replaced with Istanbul as the app's coverage provider. The V8 reports, while nice, turned out to be a little unreliable and not particularly useful; switching back to Istanbul provides us with meaningful coverage reports we can use to improve our code."
    },
    {
      "change": "Fixes",
      "description": "Fixed a bug where the button for dismissing user reports (in AdminReports) didn't correctly handle user reports. This happened due to a missing parameter, which caused the app to attempt to close a post report instead of a user report. The parameter was added to ensure the correct type of report is used."
    },
    {
      "change": "Chores",
      "description": "Deleted the user module and switched all components within it to standalone components. This cleans up some unnecessary extra code for setting up the module (without doing anything meaningful with it)."
    },
    {
      "change": "Chores",
      "description": "Cleaned up duplicate code in the AboutApp and SitePolicies components. Previously we set up the list of site policies in both components separately, which required updating in multiple places when a change was made. Now, the AboutApp component simply imports the data from the SitePolicies component."
    },
    {
      "change": "Chores",
      "description": "Added further unit tests and cleaned up unnecessary imports (such as the app's full route list) from various tests."
    },
    {
      "change": "Chores",
      "description": "Deleted unneeded code from the messages component. The deleted code was responsible for setting the colours in the users' icons; since this is now handled by the user icon component, the code was no longer needed (and should've been removed in [#1755](https://github.com/sendahug/send-hug-frontend/pull/1755))."
    }
  ]
}
